fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьГрафик(Команда)
	
	ПроверитьГрафикНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьГрафикНаСервере()
	
	ЗамечанияНайдены = Ложь;
	ОтпускаПоСотрудникам = Новый Соответствие;
	НомерСтроки = 0;
	
	Для Каждого СтрокаОтпуска Из Объект.ОтпускаСотрудников Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если СтрокаОтпуска.ДатаНачала = '00010101' Или СтрокаОтпуска.ДатаОкончания = '00010101' Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоКалендарныхДней = СтрокаОтпуска.ДатаОкончания - СтрокаОтпуска.ДатаНачала + 1;
		
		Если КоличествоКалендарныхДней > 28 Тогда
			ЗамечанияНайдены = Истина;
			ВывестиСообщение(
				СтрШаблон("Объект.ОтпускаСотрудников[%1].ДатаОкончания", НомерСтроки - 1),
				СтрШаблон(
					"Отпуск сотрудника %1 длится %2 календарных дней и превышает 28 дней.",
					СтрокаОтпуска.Сотрудник, КоличествоКалендарныхДней));
		КонецЕсли;
		
		ИнтервалыОтпусков = ОтпускаПоСотрудникам.Получить(СтрокаОтпуска.Сотрудник);
		Если ИнтервалыОтпусков = Неопределено Тогда
			ИнтервалыОтпусков = Новый Массив;
			ОтпускаПоСотрудникам.Вставить(СтрокаОтпуска.Сотрудник, ИнтервалыОтпусков);
		КонецЕсли;
		
		Для Каждого ИнтервалОтпуска Из ИнтервалыОтпусков Цикл
			
			Если СтрокаОтпуска.ДатаНачала <= ИнтервалОтпуска.Конец
				И СтрокаОтпуска.ДатаОкончания >= ИнтервалОтпуска.Начало Тогда
				
				ЗамечанияНайдены = Истина;
				ВывестиСообщение(
					СтрШаблон("Объект.ОтпускаСотрудников[%1].ДатаНачала", НомерСтроки - 1),
					СтрШаблон(
						"Отпуск сотрудника %1 (%2 - %3) пересекается с отпуском %4 - %5.",
						СтрокаОтпуска.Сотрудник,
						Формат(СтрокаОтпуска.ДатаНачала, "ДЛФ=D"),
						Формат(СтрокаОтпуска.ДатаОкончания, "ДЛФ=D"),
						Формат(ИнтервалОтпуска.Начало, "ДЛФ=D"),
						Формат(ИнтервалОтпуска.Конец, "ДЛФ=D")));
				
			КонецЕсли;
			
		КонецЦикла;
		
		ИнтервалыОтпусков.Добавить(Новый Структура("Начало, Конец", СтрокаОтпуска.ДатаНачала, СтрокаОтпуска.ДатаОкончания));
		
	КонецЦикла;
	
	Если Не ЗамечанияНайдены Тогда
		ВывестиСообщение("", "Замечаний по графику отпусков не найдено.");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ВывестиСообщение(ПутьКПолю, Текст)
	
	Сообщение = Новый СообщениеПользователю;
	Если ЗначениеЗаполнено(ПутьКПолю) Тогда
		Сообщение.Поле = ПутьКПолю;
	КонецЕсли;
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти
